/*
1. Створити змінні a, b. Присвоїти їм числові значення та вивести у консоль результат їхнього множення

2. Створити змінні с, d. Присвоїти їм числові значення та вивести у консоль результат їхнього поділу.

3. Переробити нижчеприведений код, використовуючи скорочені математичні оператори (+=, -=, *=, /=, ++, --)

let num = 1;
num = num + 1;
num = num - 1;
num = num + 22;
num = num * 33;
num = num / 44;
num = num - 55;


*/


// 1
let a = 5;
let b = 10;
console.log(a * b);

// 1
let c = 10;
let d = 2;
console.log(c / d);

//3
let num = 1;
num++;
num--;
num += 11;
num *= 33;
num /= 44;
num -= 55;
