/*  Оператор if-else   */

/*

if (умова, яка має повернути логічне значення) {
    блок коду, який виконується, якщо умова = true
} else {
    блок коду, який виконається, якщо умова = false
}

*/


let numb = Number(prompt('Введіть число більше 20'));

if (numb > 20) {
    alert('Це правильне число');
} else {
    alert('Це число не підходить');
}


/////
console.log('Код продовжив виконуватись далі після всіх попередніх дій')


////

/*
Спитати у користувача, скільки йому років,
якщо більше 18 - вивести "ви повнолітня людина"
якщо менше - вивести "ви неповнолітня людина"

*/


let userAge = Number(prompt('Скільки вам років?'));

if (userAge >= 18) {
    console.log('Ви повнолітня людина');
} else {
    console.log('Ви неповнолітня людина');
}





/*
Спитати у користувача будь-яке число (включно з від'ємним)
Якщо число від'ємне - вивести alert, що воно від'ємне
Якщо додатнє - вивести, що воно додатнє

*/


let userNumber = Number(prompt('Введіть будь-яке число'));

if (userNumber >= 0) {
    alert('Це додатнє число')
} else {
    alert('Це від\'ємне число');
}


/*
Є дві проблеми:
1. Нуль не додатній і не від'ємний. Нуль - нейтральний

2. Ми взагалі не враховуємо випадок, якщо користувач вводить фігню

*/