/* Стандартні вбудовані об'єкти

Date
Math
Errors

*/

// Math

Math.random() // рандомні значення від 0 до 1

// Округлення
Math.ceil() // округлення вверх, до найбільшого цілого

Math.floor() // округлення вниз, до найменшого цілого

Math.round() // до найближчого цілого: 0.1 - 0.49 -> 0,  0.5-0.99 -> 1 


Math.trunc() // відсікає дрібну частину


Math.min() // найменше з запронованих аргументів

Math.max() // найбільше з запронованих аргументів

//Math.pow(base, power) === base ** power


Math.sqrt() // квадратний корінь з числа