/*
Детермінованість - це характеристика функції, за якої при одних і тих самих вхідних даних функція завжди повертає один і той самий результат


Чисті функції (pure function)
Це такі функції, для яких виконуються дві умови:
1. Детермінованість
2. Відсутність "побічних ефектів"


"Побічний ефект" - це коли код лізе в оточуючий світ.
- виведення чогось на консоль, alert та інш. інтерфейси взаємодії
- надсилання запитів на сервер
- отримання інформації з сервера


*/


function sum(num1, num2) { //Чиста функція
    return num1+num2
}

 
function getRandom() {  // не детермінована
    return Math.random();
}


function multyply(num1, num2) { // Детермінована, але має "побічний ефект"
    let res = num1 * num2;
    console.log('Result = ', res);
    return res;
}



/*Області видимості*/