/* Інші оператори
https://developer.mozilla.org/ru/docs/Web/JavaScript/Guide/Expressions_and_operators


 3 + 3
 (бінарна операція)

 typeof 3
 x++
 --x
 (унарний оператор)

 */



 // Зведення у ступінь
 let x = 2;
 x = x * x; // 4
 x = x**3; // 8



 /// Залишок від цілочисленого поділу (%)
 // Ділення по модулю
 // Ціле число, яке залишається від цілочисленого поділу двох операндів

 4 % 3 // 1
 6 % 2 // 0






 /* Операції порівняння
 Результатом буде тип даних Boolean (тобто, або true, або false)
 > - більше
 < - менше
 >= - більше або дорівнює
 <= - менше або дорівнює

 3 > 2 //true
 5 > 8 //false


 для порівняння літер використовується unicode
 'z' > 'a'     ----> 122 > 97
 true


 'd' - номер 100
 'e' - номер 101
 101 > 100

2 >= 2 //true
2 <= 2 //true

Оператор "=" - це оператор присвоювання значення

== - оператором порівняння з приведенням (автоматично і неявно ПРИВОДИТЬ типи даних операндів до одного типу)
=== - оператор порівняння без приведення (порівнює і за значенням, і за типом даних)

3 == 3 //true
4 === 4 //true
3 == '3' // true - приводить типи!
3 === '3' //false - порівняв не тільки за значенням, але й за типом даних



! - оператор логічного заперечення

Оператор "не дорівнює"

!= - не дорівнює (типи приводяться до одного)
!== - не дорівнює (без приведення типів)

3 != 3 //false, бо 3 == 3, вони дорівнюють одне одному
4 != 3 // true, бо дійсно, 4 не 3

3 != '3' //false, бо String неявно приводиться до Number
3 !== '3' //true, бо порівнюється не тільки за значенням, але й за типом даних, а String не дорівнює Number


*/

