/*
Типи даних в js
Boolean - логічний тип - true або false
Number - будь-які числа
String - це будь-які строки (текст)

null - спеціальне "пусте" значення
undefined - тип "невизначеність"

*/


/*
Змінні
Змінна - це іменована область пам'яті, в якій лежить певне значення
Якщо ми викликаємо її ім'я, то на це місце підставляється значення цієї змінної

let - ключове слово для створення змінних
const - ключове слово для створення констант

*/

let box;
box = 5;






/*
Оператор 


typeof


+  додавання
-  віднімання
*  множення
/  ділення



*/


box = 1;
let result = 0;

result = box + 1; // 2

box = box + 4; // 5
box = box * 2; // 10


/*
Створіть змінну result
Прийсвойте їй число 2
Помножте на 5
Поділіть на 2
додайте 1


*/

//result = result + 5;
result += 5;
//result = result - 2;
result -= 2;
// result = result * 4;
result *= 4;
// result = result / 2;
result /= 2;


/* Інкремент/Декремент */

let value = 0;
//value = value + 1;
value++; // Інкремент - збільшення значення на 1

value--; // Декремент - зменшення значення на 1
// value = value - 1


// Постфікс (спочатку ім'я змінної, потім оператор)
value++;
value--;
/// Спочатку використовується значення змінної, а потім виконується операція збільшення/зменшення

result = value++; //


// Префіксна форма (спочатку оператор, потім ім'я змінної)
++value;
--value;

result = --value; // Спочатку віднімаємо 1, потім таке саме значення кладем в result