/// Debugger

/*
Запитати у користувача число. Якщо воно парне - вивести в консоль, що воно парне
Якщо непарне - вивести, що непарне.

*/

debugger;

let userNumber = Number(prompt('Введіть число'));


if (isNaN(userNumber)) {
    console.log('Ви ввели не число')
} else if (userNumber % 2) {
    console.log('Це непарне число')
} else {
    console.log('Це парне число');
}

/*
Попросити користувача ввести послідовно два числа (дві операції).
(Перетворення на намбер - ще по одному кроку на кожне число)

Якщо сумма цих двох чисел ділиться на 5 - вивести alert, що сума кратна 5
Інакше - вивести, що сума не кратна 5
(одна перевірка на if, і гілка else, якщо ні)


Після виконання дослідити в дебагері крок за кроком виконання вашого коду
*/