/*
Типи даних в js
Boolean - логічний тип - true або false
Number - будь-які числа
String - це будь-які строки (текст)

null - спеціальне "пусте" значення
undefined - тип "невизначеність"

*/

/* Number */
/* Можливі значення:
-  2**64 - 2**53 + 3 можливих чисел (18 437 736 874 454 810 627)
- +Infinity (безкінечність), -Infinity
- NaN (Not-a-Number) - не-число (непонятно-шо)

NaN стає результатом "неправильних" обчислень (наприклад, множення або ділення числа на рядок)
*/ 


3 / 0   //Infinity
3 / Infinity //0

/*
 Оператори -, *, / працюють тільки з числами

 Оператор +, якщо обидва операнди - числа - працює як математичний оператор "+"
 Якщо обидва операнди - рядки, він працює на конкатенацію (склеювання рядків)
 Якщо хоч один операнд "+" є рядком, то ВСІ операнди виразу НЕЯВНО приводяться до рядка
*/


/* Неявне приведення типів даних */

// Неявне приведення типу відбувається, коли операнди різних типів даних
// Якщо один з операндів + - рядок, то всі операнди стають рядком, результат - теж рядок
// Якщо один з операндів при -, *, / є рядком, то його НАМАГАЮТЬСЯ привести до числа.
// якщо цей операнд приводиться до числа (наприклад, це "345" - це 345), то відбувається математична операція
// якщо цей операнд неможливо зробити числом (наприклад, "абц"), то результатом буде NaN


/*
to Number:
true -> 1
false -> 0
'345' -> 345
'a' -> NaN


to String:
2 -> '2'
true -> 'true'
'3n' -> '3'
null -> 'null'
'undefined' -> 'undefined'


to Boolean:
0 -> false
1, 2, 3,..... -> true (будь-яке число не 0)
NaN -> false
Infinity -> true
null -> false
undefined -> false
'' -> false
'a' -> true (будь-яка літера, рядок з довжиною більше 0)

*/