/*
Типи даних в js
Boolean - логічний тип - true або false
Number - будь-які числа
String - це будь-які строки (текст)

null - спеціальне "пусте" значення
undefined - тип "невизначеність"

*/


/*
Змінні
Змінна - це іменована область пам'яті, в якій лежить певне значення
Якщо ми викликаємо її ім'я, то на це місце підставляється значення цієї змінної

let - ключове слово для створення змінних
const - ключове слово для створення констант

*/

let box = 5;
/* Створи змінну з ім'ям box і поклади в неї 5*/

let variable; /* Декларація (ініціалізація) змінної */
variable = "hello"; /* Присвоювання значення */