/*
Попросити користувача ввести послідовно два числа (дві операції).
(Перетворення на намбер - ще по одному кроку на кожне число)

Якщо сумма цих двох чисел ділиться на 5 - вивести alert, що сума кратна 5
Інакше - вивести, що сума не кратна 5
(одна перевірка на if, і гілка else, якщо ні)


Після виконання дослідити в дебагері крок за кроком виконання вашого коду
*/

let num1 = Number(prompt('Введіть перше число'));
let num2 = Number(prompt('Введіть друге число'));


if ((num1 + num2) % 5) {
    alert('Сума чисел не ділиться на 5')
} else {
    alert('Сума чисел ділиться на 5')
}