/*
Спитати у користувача будь-яке число (включно з від'ємним)
Якщо число від'ємне - вивести alert, що воно від'ємне
Якщо додатнє - вивести, що воно додатнє

*/


let userNumber = Number(prompt('Введіть будь-яке число'));


/*
if (userNumber >= 0) {
    alert('Це додатнє число')
} else {
    alert('Це від\'ємне число');
}
*/


/*
Є дві проблеми:
1. Нуль не додатній і не від'ємний. Нуль - нейтральний

2. Ми взагалі не враховуємо випадок, якщо користувач вводить фігню

*/


/*  Оператор if-else if - else   */

/*

if (умова, яка має повернути логічне значення) {
    блок коду, який виконується, якщо умова = true
} else if (інша умова) {
    блок коду, якщо ця інша умова = true
} else if (третя умова) {
    блок коду, якщо ця третя умова = true
}
.....
else {
    блок коду, який виконається, якщо жодна з умов не була true
}

*/

if (userNumber > 0) {
    alert('Це додатнє число')
} else if (userNumber === 0) {
    alert('Нуль - не додатнє і не від\'ємне ')
} else if (userNumber < 0) {
    alert('Це від\'ємне число')
} else {
    alert('Ви ввели не число')
} 

////////////

isNaN(NaN) // true
isNaN('3') // false
isNaN(null) // false
isNaN(undefined) //true
isNaN('a') // true