/* Symbol */

const symb = Symbol();

const obj = {
    key: 'value',
    a: 'b',
    1: 'c',
    [symb]: 'symbol key value'
}

const arr = [1, 2, 3, 4, 5, 6];


for (const key of arr) {
 //   console.log(key);
}



/*
Ітератор - це об'єкт (який є реалізацією ідеї-паттерна), що реалізує принцип перебору об'єкта


Symbol.iterator - це зарезервований системний метод, який повертає об'єкт ітератора

Виклик метода [Symbol.iterator] повертає об'єкт Ітератора
У об'єкті Ітератора має бути метод next()
Метод next() повертає об'єкт з двома обов'язковими властивостями:
    - value: це значення поточного елемента, якого ми перебираємо
    - done: чи дійшли ми до кінця колекції?

*/


