/*
Типи даних в js
Boolean - логічний тип - true або false
Number - будь-які числа
String - це будь-які строки (текст)

null - спеціальне "пусте" значення
undefined - тип "невизначеність"

*/


/*
Змінні
Змінна - це іменована область пам'яті, в якій лежить певне значення
Якщо ми викликаємо її ім'я, то на це місце підставляється значення цієї змінної

let - ключове слово для створення змінних
const - ключове слово для створення констант

*/

let box = 5;
/* Створи змінну з ім'ям box і поклади в неї 5*/

/// а вот на цьому етапі в box все ще число 5


box = 10;

/////// вот тут box має число 10


box = "text";



/*
Оператор 


typeof


+  додавання
-  віднімання
*  множення
/  ділення



*/


box = true;


let a = 5;




/* Naming (називання) змінних

Назва змінної має пояснювати, для чого вона є або що всередині
В js використовуємо camelCase

let userInputValue;
let userName;
let userAvatarURL;

*/



