/* Функція  

Функція - це ізольований блок коду, який працює незалежно від основного коду, має власну область видимості
*/

/*
Визначення функції (її об'явлення)
function ім'я функції(аргументи) {
    блок коду функції
} 


Виклик функції:
ім'я функції(аргументи)

*/

function sayHello() {   /// Function declaration
    console.log('Привіт, юзере!')
}

sayHello();
/////


/*
Зробити функцію, яка виводить alert("Сьогодні чудова погода") і викличте цю функцію

*/


function sayCoolWeather() {
    alert('Today is cool weather');
}

sayCoolWeather()